// Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).

let j = '';
for (let i = 20; i <= 30; i = i + 0.5) {
    j += i + ' ';
}
console.log(j);


// Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

let k = '';
let sum = 27;

for (let i = 10; i < 101; i = i + 10) {
    k += i * sum + ',';
};
console.log(k);

// Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.

let num = 400;

for (let i = 0; i <= 100; i++) {
    if (i * i <= num) {
        console.log([i]);
    }
}

// Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

const n = prompt('Введите число');

for (let i = 0; i < n; i++) {
    if (n % n === 0 && n > i && n % 2 ==! 0) {
        console.log('Целое число');
    } else {
        console.log('Не целое');
    }
}

// Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

const numTwo = prompt('Введите число');

for (let i = 0; i < numTwo; i++) {
    if (numTwo % 3 === 0) {
        console.log('Число можно получить ');
    } else {
        console.log('Число нельзя получить');
    }
}